; domain
(define (domain aviones)
(:requirements :strips)
(:predicates
	(en ?a ?b) 
	(avion ?a)
	(carga ?c)
	(aeropuerto ?a)
) 
(:action cargar
 :parameters ( ?c ?a ?ap)
 :precondition
	(and (en ?c ?ap) (en ?a ?ap) (carga ?c) (avion ?a) (aeropuerto ?ap))
 :effect
	(and 
		(en ?c ?a) 
		(not (en ?c ?ap))
	)
)
(:action descargar
 :parameters ( ?c ?a ?ap)
 :precondition
	(and (en ?c ?a) (en ?a ?ap) (carga ?c) (avion ?a) (aeropuerto ?ap))
 :effect
	(and 
		(en ?c ?ap) 
		(not (en ?c ?a))
	)
)
(:action volar
 :parameters ( ?a ?origen ?destino)
 :precondition
	(and (en ?a ?origen) (avion ?a) (aeropuerto ?origen) (aeropuerto ?destino))
 :effect
	(and 
		(en ?a ?destino) 
		(not (en ?a ?origen))
	)
)
)

; problem
; Online-Solver: http://lcas.lincoln.ac.uk/fast-downward/
; ^__ No anduvo!!

; Por consola:
; cd TP2/EJ2
; A_estrella: ./downward/fast-downward.py pddl-aviones-vaccines/aviones-domain.pddl pddl-aviones-vaccines/aviones-problem.pddl --search "astar(lmcut())"
; Default: ./downward/fast-downward.py pddl-aviones-vaccines/aviones-domain.pddl pddl-aviones-vaccines/aviones-problem.pddl --search "lazy_greedy([ff()], preferred=[ff()])"
; Ver plan: cat sas_plan

(define (problem carga-aerea)
    (:domain aviones)
    (:objects 
        ; Aviones Disponibles
        LA01
        LA02
        LA03
        AA01
        AA02
        AA03
        FB01
        FB02
        FB03

        ; Origen de las Vacunas y Destino (Argentina, España)
        INDIA
        CHINA
        UK
        RUSIA
        EEUU
        ARG
        ESP

        ; Vacunas COVID
        COVISHIELD
        SINOPHARM
        ASTRAZENECA
        SPUTNIK-V
        PFIZER
        MODERNA
    )
    (:init 
        (avion LA01)
        (avion LA02)
        (avion LA03)
        (avion AA01)
        (avion AA02)
        (avion AA03)
        (avion FB01)
        (avion FB02)
        (avion FB03)

        (aeropuerto INDIA)
        (aeropuerto CHINA)
        (aeropuerto UK)
        (aeropuerto RUSIA)
        (aeropuerto EEUU)
        (aeropuerto ARG)
        (aeropuerto ESP)

        (carga COVISHIELD)
        (carga SINOPHARM)
        (carga ASTRAZENECA)
        (carga SPUTNIK-V)
        (carga PFIZER)
        (carga MODERNA)

        (en LA01 ARG)
        (en LA02 ARG)
        (en LA03 ESP)
        (en AA01 ARG)
        (en AA02 ARG)
        (en AA03 ESP)
        (en FB01 ARG)
        (en FB02 ESP)
        (en FB03 ESP)

        (en COVISHIELD INDIA)
        (en SINOPHARM CHINA)
        (en ASTRAZENECA UK)
        (en SPUTNIK-V RUSIA)
        (en PFIZER EEUU)
        (en MODERNA EEUU)
    )
    (:goal 
        (and
            (en ASTRAZENECA ARG)
            (en SINOPHARM ARG)
            (en SPUTNIK-V ARG)
            (en COVISHIELD ARG)

            (en PFIZER ESP)
            (en MODERNA ESP)
        )
    )
)

; plan
1. (volar la03 esp china)
   deleted: (en la03 esp)
   added: (en la03 china)
   goals met: 0 of 6
2. (cargar sinopharm la03 china)
   deleted: (en sinopharm china)
   added: (en sinopharm la03)
   goals met: 0 of 6
3. (volar la03 china india)
   deleted: (en la03 china)
   added: (en la03 india)
   goals met: 0 of 6
4. (cargar covishield la03 india)
   deleted: (en covishield india)
   added: (en covishield la03)
   goals met: 0 of 6
5. (volar la03 india rusia)
   deleted: (en la03 india)
   added: (en la03 rusia)
   goals met: 0 of 6
6. (cargar sputnik-v la03 rusia)
   deleted: (en sputnik-v rusia)
   added: (en sputnik-v la03)
   goals met: 0 of 6
7. (volar la03 rusia uk)
   deleted: (en la03 rusia)
   added: (en la03 uk)
   goals met: 0 of 6
8. (cargar astrazeneca la03 uk)
   deleted: (en astrazeneca uk)
   added: (en astrazeneca la03)
   goals met: 0 of 6
9. (volar la03 uk arg)
   deleted: (en la03 uk)
   added: (en la03 arg)
   goals met: 0 of 6
10. (descargar sputnik-v la03 arg)
   deleted: (en sputnik-v la03)
   added: (en sputnik-v arg)
   goals met: 1 of 6
11. (descargar sinopharm la03 arg)
   deleted: (en sinopharm la03)
   added: (en sinopharm arg)
   goals met: 2 of 6
12. (descargar covishield la03 arg)
   deleted: (en covishield la03)
   added: (en covishield arg)
   goals met: 3 of 6
13. (descargar astrazeneca la03 arg)
   deleted: (en astrazeneca la03)
   added: (en astrazeneca arg)
   goals met: 4 of 6
14. (volar la03 arg eeuu)
   deleted: (en la03 arg)
   added: (en la03 eeuu)
   goals met: 4 of 6
15. (cargar pfizer la03 eeuu)
   deleted: (en pfizer eeuu)
   added: (en pfizer la03)
   goals met: 4 of 6
16. (cargar moderna la03 eeuu)
   deleted: (en moderna eeuu)
   added: (en moderna la03)
   goals met: 4 of 6
17. (volar la03 eeuu esp)
   deleted: (en la03 eeuu)
   added: (en la03 esp)
   goals met: 4 of 6
18. (descargar pfizer la03 esp)
   deleted: (en pfizer la03)
   added: (en pfizer esp)
   goals met: 5 of 6
19. (descargar moderna la03 esp)
   deleted: (en moderna la03)
   added: (en moderna esp)
   goals met: 6 of 6
